In [1]:
import numpy as np
import pandas as pd

In [2]:
out_idx = ['T1', 'T1', 'T1', 'T2', 'T2', 'T2']
in_idx = [1, 2, 3, 4, 5, 6]
idx_hier = list(zip(out_idx, in_idx))
idx_hier

[('T1', 1), ('T1', 2), ('T1', 3), ('T2', 4), ('T2', 5), ('T2', 6)]

In [3]:
mul_idx = pd.MultiIndex(levels=[['T1', 'T2'], [1, 2, 3]],
                       codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [4]:
mul_idx

MultiIndex([('T1', 1),
            ('T1', 2),
            ('T1', 3),
            ('T2', 1),
            ('T2', 2),
            ('T2', 3)],
           )

In [5]:
df = pd.DataFrame(np.random.randn(6, 2), mul_idx, ['X', 'Y'])
df

             X         Y
T1 1  0.729892 -0.460767
   2 -0.425032 -1.302095
   3 -0.349226  0.274369
T2 1 -1.352015 -0.354318
   2 -0.840758 -0.598818
   3 -1.959288 -0.864652

In [6]:
df.loc['T1']

          X         Y
1  0.729892 -0.460767
2 -0.425032 -1.302095
3 -0.349226  0.274369

In [7]:
df.loc['T1'].loc[2]

X   -0.425032
Y   -1.302095
Name: 2, dtype: float64

In [8]:
df.index.names

FrozenList([None, None])

In [9]:
df.index.names = ['Types', 'Numbers']
df

                      X         Y
Types Numbers
T1    1        0.729892 -0.460767
      2       -0.425032 -1.302095
      3       -0.349226  0.274369
T2    1       -1.352015 -0.354318
      2       -0.840758 -0.598818
      3       -1.959288 -0.864652

In [10]:
df.loc['T1']

                X         Y
Numbers
1        0.729892 -0.460767
2       -0.425032 -1.302095
3       -0.349226  0.274369

In [11]:
df.loc['T1'].loc[3]

X   -0.349226
Y    0.274369
Name: 3, dtype: float64

In [12]:
df.loc['T1'].loc[3]['Y']

np.float64(0.27436908513650005)

In [13]:
df

                      X         Y
Types Numbers
T1    1        0.729892 -0.460767
      2       -0.425032 -1.302095
      3       -0.349226  0.274369
T2    1       -1.352015 -0.354318
      2       -0.840758 -0.598818
      3       -1.959288 -0.864652

In [14]:
df.loc['T2']

                X         Y
Numbers
1       -1.352015 -0.354318
2       -0.840758 -0.598818
3       -1.959288 -0.864652

In [15]:
df.xs('T2')

                X         Y
Numbers
1       -1.352015 -0.354318
2       -0.840758 -0.598818
3       -1.959288 -0.864652

In [16]:
df

                      X         Y
Types Numbers
T1    1        0.729892 -0.460767
      2       -0.425032 -1.302095
      3       -0.349226  0.274369
T2    1       -1.352015 -0.354318
      2       -0.840758 -0.598818
      3       -1.959288 -0.864652

In [18]:
df.xs(2, level='Numbers')

              X         Y
Types
T1    -0.425032 -1.302095
T2    -0.840758 -0.598818